import { Container, PageSection } from "../../main.styled";

const FooterConditions = () => {
  return (
    <PageSection>
      <Container>
        <h2>Умови та положення</h2>
        <p>1.Опис продукції</p>
        <p>
          Ми надаємо детальну інформацію про всі продукти, включаючи розміри,
          кольори, матеріали та інші характеристики. Проте, ми не гарантуємо
          точність відтінків через індивідуальні налаштування моніторів
          користувачів.{" "}
        </p>
        <p>2. Ціни та оплата</p>
        <p>
          Ціни на сайті можуть змінюватися без попереднього повідомлення. Усі
          ціни вказані в національній валюті та включають податки, де це
          необхідно. Ми приймаємо оплату через кредитні картки, PayPal та інші
          зручні для вас способи.
        </p>
        <p>3. Доставка </p>
        <p>
          Ми здійснюємо доставку на територію України за допомогою надійних
          служб доставки. Терміни та вартість доставки можуть варіюватися
          залежно від місця призначення та обраного способу доставки.
        </p>
        <p> 4. Повернення та обмін</p>
        <p>
          {" "}
          Ми приймаємо повернення або обмін товару протягом 30 днів з моменту
          покупки. Товар повинен бути в оригінальній упаковці та стані. Вартість
          повернення товару несе покупець, за винятком випадків фабричного
          дефекту чи неправильної доставки.
        </p>
        <p> 5. Конфіденційність та безпека</p>
        <p>
          {" "}
          Ми зобов'язуємося зберігати особисту інформацію наших клієнтів
          конфіденційно та не передавати її третім особам без вашого письмового
          згоди. Ми використовуємо файли cookies для збору інформації про
          користувачів нашого сайту з метою поліпшення сервісу та персоналізації
          рекламних пропозицій.{" "}
        </p>
        <p>6. Права та обов'язки </p>
        Ми залишаємо за собою право відмовити у обслуговуванні будь-якого
        клієнта у разі порушення умов користування. Клієнти також зобов'язані
        дотримуватися умов користування та правил поведінки на сайті.
        <p>7. Інтелектуальна власність </p>
        <p>
          Весь контент нашого сайту, включаючи тексти, зображення та логотипи,
          захищений авторським правом і торговою маркою та не може бути
          використаний без нашої письмової згоди.
        </p>
        <p> 8. Юрисдикція та судові спори</p>
        <p>
          У випадку судових суперечок, сторони зобов'язуються вирішувати їх
          мирним шляхом.
        </p>
        <p> 9. Загальні положення </p>
        <p>
          Ці умови та положення становлять юридичну угоду між вами та нами, що
          регулює ваш доступ та використання нашого сайту та послуг.
        </p>
      </Container>
    </PageSection>
  );
};

export default FooterConditions;
