import { Container, PageSection } from "../../main.styled";

const FooterGuarantee = () => {
  return (
    <PageSection>
      <Container>
        <h2>Гарантія та повернення</h2>
        <p>1. Гарантія на товари</p>
        <p>
          Ми гарантуємо якість нашої продукції та надаємо гарантійні
          зобов'язання відповідно до чинного законодавства. Гарантійний термін
          вказується на кожному товарі окремо. У разі виявлення дефектів, що
          виникли в результаті виробничого процесу, ми зобов'язуємося замінити
          товар або повернути кошти.{" "}
        </p>
        <p>2. Повернення товару</p>
        <p>
          Якщо ви не задоволені придбаною продукцією з будь-яких причин, ми радо
          приймемо її назад протягом 30 днів з моменту придбання. Для повернення
          товару потрібно зберегти оригінальну упаковку та чек про придбання.
        </p>
        <p>3. Процедура повернення</p>
        <p>
          Для оформлення повернення, будь ласка, зв'яжіться з нашим відділом
          обслуговування клієнтів за контактними даними, вказаними на нашому
          веб-сайті. Після розгляду вашого запиту ми зв'яжемося з вами та надамо
          вказівки щодо процедури повернення.
        </p>
        <p> 4. Умови повернення</p>
        <ul>
          <li>
            Повернення приймається тільки у випадку, якщо товар не був вживаний
            та збережено всі етикетки та упаковку.
          </li>
          <li>
            Вартість повернення товару покриває клієнт, за винятком випадків,
            коли причиною повернення є фабричний дефект чи неправильна доставка.
          </li>
          <li>
            Грошовий повернення здійснюється за допомогою того ж методу оплати,
            який ви використовували для замовлення.
          </li>
        </ul>
        <p> 5. Винятки</p>
        <p>
          {" "}
          Деякі товари можуть бути виключені з політики повернення через
          гігієнічні або інші обставини. Це буде зазначено на сторінці товару.
          Ця політика повернення діє лише для товарів, придбаних у нашому онлайн
          магазині. Для товарів, куплених у роздрібних магазинах або інших
          місцях, будуть застосовуватися власні умови повернення.{" "}
        </p>
      </Container>
    </PageSection>
  );
};

export default FooterGuarantee;
