import { Container, PageSection } from "../../main.styled";

const FooterPrivacyPolicy = () => {
  return (
    <PageSection>
      <Container>
        <h2>Політика конфіденційності</h2>
        <p>
          Дякуємо за використання нашого веб-сайту. Наша політика
          конфіденційності пояснює, як ми збираємо, використовуємо та захищаємо
          вашу інформацію при відвідуванні та використанні нашого сайту.
        </p>
        <h3>Збір і використання інформації:</h3>
        <p>
          Ми збираємо різноманітну інформацію, щоб забезпечити краще
          обслуговування наших клієнтів та покращити функціональність нашого
          сайту. Інформація, яку ми збираємо, може включати особисту інформацію,
          таку як ім'я, адреса електронної пошти, номер телефону тощо, яку ви
          нам надаєте добровільно при реєстрації або під час оформлення
          замовлення. Ми можемо використовувати вашу особисту інформацію для
          зв'язку з вами стосовно вашого замовлення, повідомлення вас про акції
          та спеціальні пропозиції, а також для поліпшення нашого обслуговування
          та асортименту товарів.
        </p>
        <h3>Захист інформації:</h3>
        <p>
          Ми приділяємо велику увагу безпеці вашої особистої інформації і
          вживаємо відповідних заходів безпеки для її захисту від
          несанкціонованого доступу, втрати, зловживання та розголошення. Ми не
          розголошуємо вашу особисту інформацію третім особам без вашого згоди,
          за винятком випадків, передбачених законом.
        </p>
        <h3>Cookies:</h3>
        <p>
          Наш веб-сайт може використовувати cookies для збору інформації та
          поліпшення користувацького досвіду. Cookies є невеликими текстовими
          файлами, які можуть бути збережені на вашому пристрої, коли ви
          відвідуєте веб-сайт. Ви можете налаштувати свій веб-браузер відхиляти
          всі cookies або попереджати про їх відправлення. Проте, відмова від
          використання cookies може призвести до обмеження деяких функцій нашого
          веб-сайту.
        </p>
        <h3> Посилання на інші сайти:</h3>
        <p>
          Наш веб-сайт може містити посилання на інші сайти, які не
          контролюються нами. Ми не несемо відповідальності за політику
          конфіденційності або вміст таких сайтів.
        </p>
        <h3>Зміни у політиці конфіденційності:</h3>
        <p>
          Ми можемо час від часу оновлювати нашу політику конфіденційності. Будь
          ласка, періодично переглядайте цю сторінку, щоб бути в курсі будь-яких
          змін.
        </p>
        <h3>Контактна інформація:</h3>
        <p>
          Якщо у вас виникли питання щодо нашої політики конфіденційності, будь
          ласка, зв'яжіться з нами за телефоном 0(800) 23 75 56, (044) 23 75 568
          або напишіть на пошту pulseRun@gmail.com{" "}
        </p>
      </Container>
    </PageSection>
  );
};

export default FooterPrivacyPolicy;
