import { Container, PageSection } from "../../main.styled";

const FooterDelivery = () => {
  return (
    <PageSection>
      <Container>
        <h2>Доставка</h2>
        <h3>1. Які умови доставки?</h3>
        <p>Зона доставки:</p>
        <p>Ми відправляємо товари по всій Україні*.</p>
        <p>
          *Ми тимчасово не доставляємо замовлення на окуповані території в
          Донецькій, Луганській, Херсонскій, Запорізькій, Харківській областях і
          в Крим.
        </p>
        <ul>
          Доступні варіанти доставки:
          <li>У відділення Нова Пошта;</li>
          <li>У поштомат “Нова Пошта”;</li>
          <li>
            Кур'єрська доставка за адресою.
            <span>
              Відправлення здійснюється в день оформлення замовлення або
              максимум наступного дня:
            </span>
          </li>
          <li>
            {" "}
            Доставка Новою Поштою становить до доби в межах Києва і до 2 днів по
            Україні.
          </li>
        </ul>
        <p>Відстеження доставки:</p>
        <p>
          Як тільки замовлення буде відвантажено, ми надішлемо тобі sms з
          номером замовлення у форматі AUA12345678 і ТТН, за яким його можна
          буде відстежити. Ти можеш відстежити статус замовлення на сайті
          кур'єрської служби: Нова Пошта: https://novaposhta.ua/ru/tracking
        </p>
        <p>Термін зберігання замовлення:</p>
        <ul>
          <li>
             У відділенні “Нова пошта” – до 5 днів. Після закінчення 5 днів
            посилка автоматично повертається відправнику і не підлягає повторній
            перевідправці.
          </li>
          <li>
            У поштоматі “Нова пошта” – до 3 днів. Якщо термін зберігання спливе,
            посилку перемістять у найближче відділення Нової пошти, щоб
            звільнити комірку поштомата.
          </li>
        </ul>

        <h3>СКІЛЬКИ КОШТУЄ ДОСТАВКА?</h3>
        <p>
          {" "}
          Ми доставимо безкоштовно по Україні будь-яке замовлення на суму від
          2500 гривень. Вартість доставки розраховується на етапі оформлення
          замовлення на сайті. Вартість доставки у відділення кур'єрської служби
          "Нова Пошта" — 79 грн. Вартість кур'єрської доставки за адресою — 99
          грн. Вартість доставки у поштомат "Нова Пошта" — 79 грн. Якщо вказана
          післяплата (готівкою або банківською карткою при отриманні), то
          необхідно буде сплатити комісію за переказ грошових коштів — 20 грн +
          2% від суми замовлення; Щоб уникнути цього платежу, рекомендуємо
          оплатити замовлення карткою на сайті. Зверни увагу, що кур'єрська
          доставка оплачується незалежно від того, викупив ти замовлення або
          відмовився від нього. Кожне нове замовлення оплачується окремо, в тому
          числі при одночаснiй доставцi.
        </p>
      </Container>
    </PageSection>
  );
};

export default FooterDelivery;
